InformationRegisters/ХранилищеПаролей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеПаролей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПользовательИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиИБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
						<v8:Type>cfg:CatalogRef.ХранилищаКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХранилищеПаролей/Ext/ManagerModule.bsl
Функция ПолучитьПараметрыАвторизации(Объект, Пользователь) Экспорт
	
	СтруктураАвторизации = Новый Структура("ИмяПользователя, Пароль");
	
	// REF Хранение пароля Администратора базы перенести в регистр
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.ИнформационныеБазы") Тогда
		СтруктураАвторизации.ИмяПользователя	= Объект.ИмяПользователяИБ;
		СтруктураАвторизации.Пароль			= Объект.ПарольПользователяИБ;
		
		Возврат СтруктураАвторизации;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	ХранилищеПаролей.ИмяПользователя КАК ИмяПользователя,
				|	ХранилищеПаролей.Пароль КАК Пароль
				|ИЗ
				|	РегистрСведений.ХранилищеПаролей КАК ХранилищеПаролей
				|ГДЕ
				|	ХранилищеПаролей.ОбъектДоступа = &Объект
				|	И ХранилищеПаролей.ПользовательИБ = &Пользователь";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураАвторизации.ИмяПользователя	= Выборка.ИмяПользователя;
		СтруктураАвторизации.Пароль			= Выборка.Пароль;	
	КонецЕсли;
	
	Возврат СтруктураАвторизации;
	
КонецФункции
